stm32duino/IIS2DULPX/src/iis2dulpx_reg.h
#define IIS2DULPX_PEDO_DEB_STEPS_CONF                  0x5EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t deb_step                     : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t deb_step                     : 8;
#endif /* DRV_BYTE_ORDER */
} iis2dulpx_pedo_deb_steps_conf_t;

#define IIS2DULPX_PEDO_SC_DELTAT_L                     0xAAU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t pd_sc                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pd_sc                        : 8;
#endif /* DRV_BYTE_ORDER */
} iis2dulpx_pedo_sc_deltat_l_t;

#define IIS2DULPX_PEDO_SC_DELTAT_H                     0xABU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t pd_sc                        : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pd_sc                        : 8;
#endif /* DRV_BYTE_ORDER */
} iis2dulpx_pedo_sc_deltat_h_t;

#define IIS2DULPX_T_AH_QVAR_SENSITIVITY_L              0xB6U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t t_ah_qvar_s                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t t_ah_qvar_s                  : 8;
#endif /* DRV_BYTE_ORDER */
} iis2dulpx_t_ah_qvar_sensitivity_l_t;

#define IIS2DULPX_T_AH_QVAR_SENSITIVITY_H              0xB7U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t t_ah_qvar_s                  : 8;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t t_ah_qvar_s                  : 8;
#endif /* DRV_BYTE_ORDER */
} iis2dulpx_t_ah_qvar_sensitivity_h_t;

#define IIS2DULPX_SMART_POWER_CTRL                     0xD2U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t smart_power_ctrl_win         : 4;
  uint8_t smart_power_ctrl_dur         : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t smart_power_ctrl_dur         : 4;
  uint8_t smart_power_ctrl_win         : 4;
#endif /* DRV_BYTE_ORDER */
} iis2dulpx_smart_power_ctrl_t;

/**
  * @}
  *
  */

typedef union {
  iis2dulpx_pin_ctrl_t    pin_ctrl;
  iis2dulpx_wake_up_dur_ext_t    wake_up_dur_ext;
  iis2dulpx_who_am_i_t    who_am_i;
  iis2dulpx_ctrl1_t    ctrl1;
  iis2dulpx_ctrl2_t    ctrl2;
  iis2dulpx_ctrl3_t    ctrl3;
  iis2dulpx_ctrl4_t    ctrl4;
  iis2dulpx_ctrl5_t    ctrl5;
  iis2dulpx_fifo_ctrl_t    fifo_ctrl;
  iis2dulpx_fifo_wtm_t    fifo_wtm;
  iis2dulpx_interrupt_cfg_t    interrupt_cfg;
  iis2dulpx_sixd_t    sixd;
  iis2dulpx_wake_up_ths_t    wake_up_ths;
  iis2dulpx_wake_up_dur_t    wake_up_dur;
  iis2dulpx_free_fall_t    free_fall;
  iis2dulpx_md1_cfg_t    md1_cfg;
  iis2dulpx_md2_cfg_t    md2_cfg;
  iis2dulpx_wake_up_src_t    wake_up_src;
  iis2dulpx_tap_src_t    tap_src;
  iis2dulpx_sixd_src_t    sixd_src;
  iis2dulpx_all_int_src_t    all_int_src;
  iis2dulpx_status_register_t    status;
  iis2dulpx_fifo_status1_t    fifo_status1;
  iis2dulpx_fifo_status2_t    fifo_status2;
  iis2dulpx_out_x_l_t    out_x_l;
  iis2dulpx_out_x_h_t    out_x_h;
  iis2dulpx_out_y_l_t    out_y_l;
  iis2dulpx_out_y_h_t    out_y_h;
  iis2dulpx_out_z_l_t    out_z_l;
  iis2dulpx_out_z_h_t    out_z_h;
  iis2dulpx_out_t_ah_qvar_l_t    out_t_ah_qvar_l;
  iis2dulpx_out_t_ah_qvar_h_t    out_t_ah_qvar_h;
  iis2dulpx_ah_qvar_cfg_t    ah_qvar_cfg;
  iis2dulpx_self_test_t    self_test;
  iis2dulpx_i3c_if_ctrl_t    i3c_if_ctrl;
  iis2dulpx_emb_func_status_mainpage_t    emb_func_status_mainpage;
  iis2dulpx_fsm_status_mainpage_t    fsm_status_mainpage;
  iis2dulpx_mlc_status_mainpage_t    mlc_status_mainpage;
  iis2dulpx_sleep_t    sleep;
  iis2dulpx_en_device_config_t    en_device_config;
  iis2dulpx_func_cfg_access_t    func_cfg_access;
  iis2dulpx_fifo_data_out_tag_t    fifo_data_out_tag;
  iis2dulpx_fifo_data_out_x_l_t    fifo_data_out_x_l;
  iis2dulpx_fifo_data_out_x_h_t    fifo_data_out_x_h;
  iis2dulpx_fifo_data_out_y_l_t    fifo_data_out_y_l;
  iis2dulpx_fifo_data_out_y_h_t    fifo_data_out_y_h;
  iis2dulpx_fifo_data_out_z_l_t    fifo_data_out_z_l;
  iis2dulpx_fifo_data_out_z_h_t    fifo_data_out_z_h;
  iis2dulpx_fifo_batch_dec_t    fifo_batch_dec;
  iis2dulpx_tap_cfg0_t    tap_cfg0;
  iis2dulpx_tap_cfg1_t    tap_cfg1;
  iis2dulpx_tap_cfg2_t    tap_cfg2;
  iis2dulpx_tap_cfg3_t    tap_cfg3;
  iis2dulpx_tap_cfg4_t    tap_cfg4;
  iis2dulpx_tap_cfg5_t    tap_cfg5;
  iis2dulpx_tap_cfg6_t    tap_cfg6;
  iis2dulpx_timestamp0_t    timestamp0;
  iis2dulpx_timestamp1_t    timestamp1;
  iis2dulpx_timestamp2_t    timestamp2;
  iis2dulpx_timestamp3_t    timestamp3;
  iis2dulpx_page_sel_t    page_sel;
  iis2dulpx_emb_func_en_a_t    emb_func_en_a;
  iis2dulpx_emb_func_en_b_t    emb_func_en_b;
  iis2dulpx_emb_func_exec_status_t    emb_func_exec_status;
  iis2dulpx_page_address_t    page_address;
  iis2dulpx_page_value_t    page_value;
  iis2dulpx_emb_func_int1_t    emb_func_int1;
  iis2dulpx_fsm_int1_t    fsm_int1;
  iis2dulpx_mlc_int1_t    mlc_int1;
  iis2dulpx_emb_func_int2_t    emb_func_int2;
  iis2dulpx_fsm_int2_t    fsm_int2;
  iis2dulpx_mlc_int2_t    mlc_int2;
  iis2dulpx_emb_func_status_t    emb_func_status;
  iis2dulpx_fsm_status_t    fsm_status;
  iis2dulpx_mlc_status_t    mlc_status;
  iis2dulpx_page_rw_t    page_rw;
  iis2dulpx_emb_func_fifo_en_t    emb_func_fifo_en;
  iis2dulpx_fsm_enable_t    fsm_enable;
  iis2dulpx_fsm_long_counter_l_t    fsm_long_counter_l;
  iis2dulpx_fsm_long_counter_h_t    fsm_long_counter_h;
  iis2dulpx_int_ack_mask_t    int_ack_mask;
  iis2dulpx_fsm_outs1_t    fsm_outs1;
  iis2dulpx_fsm_outs2_t    fsm_outs2;
  iis2dulpx_fsm_outs3_t    fsm_outs3;
  iis2dulpx_fsm_outs4_t    fsm_outs4;
  iis2dulpx_fsm_outs5_t    fsm_outs5;
  iis2dulpx_fsm_outs6_t    fsm_outs6;
  iis2dulpx_fsm_outs7_t    fsm_outs7;
  iis2dulpx_fsm_outs8_t    fsm_outs8;
  iis2dulpx_step_counter_l_t    step_counter_l;
  iis2dulpx_step_counter_h_t    step_counter_h;
  iis2dulpx_emb_func_src_t    emb_func_src;
  iis2dulpx_emb_func_init_a_t    emb_func_init_a;
  iis2dulpx_emb_func_init_b_t    emb_func_init_b;
  iis2dulpx_mlc1_src_t    mlc1_src;
  iis2dulpx_mlc2_src_t    mlc2_src;
  iis2dulpx_mlc3_src_t    mlc3_src;
  iis2dulpx_mlc4_src_t    mlc4_src;
  iis2dulpx_fsm_odr_t    fsm_odr;
  iis2dulpx_mlc_odr_t    mlc_odr;
  iis2dulpx_fsm_lc_timeout_l_t    fsm_lc_timeout_l;
  iis2dulpx_fsm_lc_timeout_h_t    fsm_lc_timeout_h;
  iis2dulpx_fsm_programs_t    fsm_programs;
  iis2dulpx_fsm_start_add_l_t    fsm_start_add_l;
  iis2dulpx_fsm_start_add_h_t    fsm_start_add_h;
  iis2dulpx_pedo_cmd_reg_t    pedo_cmd_reg;
  iis2dulpx_pedo_deb_steps_conf_t    pedo_deb_steps_conf;
  iis2dulpx_pedo_sc_deltat_l_t    pedo_sc_deltat_l;
  iis2dulpx_pedo_sc_deltat_h_t    pedo_sc_deltat_h;
  iis2dulpx_t_ah_qvar_sensitivity_l_t    t_ah_qvar_sensitivity_l;
  iis2dulpx_t_ah_qvar_sensitivity_h_t    t_ah_qvar_sensitivity_h;
  iis2dulpx_smart_power_ctrl_t   smart_power_ctrl;
  bitwise_t    bitwise;
  uint8_t    byte;
} iis2dulpx_reg_t;

/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

