stm32duino/IIS2DULPX/src/iis2dulpx_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t iis2dulpx_read_reg(const iis2dulpx_ctx_t *ctx, uint8_t reg,
                           uint8_t *data,
                           uint16_t len);
int32_t iis2dulpx_write_reg(const iis2dulpx_ctx_t *ctx, uint8_t reg,
                            uint8_t *data,
                            uint16_t len);

float_t iis2dulpx_from_fs2g_to_mg(int16_t lsb);
float_t iis2dulpx_from_fs4g_to_mg(int16_t lsb);
float_t iis2dulpx_from_fs8g_to_mg(int16_t lsb);
float_t iis2dulpx_from_fs16g_to_mg(int16_t lsb);
float_t iis2dulpx_from_lsb_to_celsius(int16_t lsb);
float_t iis2dulpx_from_lsb_to_mv(int16_t lsb);

int32_t iis2dulpx_device_id_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DULPX_SENSOR_ONLY_ON     = 0x00, /* Initialize the driver for sensor usage */
  IIS2DULPX_BOOT               = 0x01, /* Restore calib. param. (it takes 10ms) */
  IIS2DULPX_RESET              = 0x02, /* Reset configuration registers */
  IIS2DULPX_SENSOR_EMB_FUNC_ON = 0x03, /* Initialize the driver for sensor and/or
                                           embedded functions usage (it takes 10ms) */
} iis2dulpx_init_t;
int32_t iis2dulpx_init_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_init_t val);

typedef struct {
  uint8_t sw_reset                     : 1; /* Restoring configuration registers */
  uint8_t boot                         : 1; /* Restoring calibration parameters */
  uint8_t drdy                         : 1; /* Accelerometer data ready */
  uint8_t power_down                   : 1; /* Monitors power-down. */
} iis2dulpx_status_t;
int32_t iis2dulpx_status_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_status_t *val);

typedef struct {
  uint8_t is_step_det                  : 1; /* Step detected */
  uint8_t is_tilt                      : 1; /* Tilt detected */
  uint8_t is_sigmot                    : 1; /* Significant motion detected */
} iis2dulpx_embedded_status_t;
int32_t iis2dulpx_embedded_status_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_embedded_status_t *val);

typedef enum {
  IIS2DULPX_DRDY_LATCHED = 0x0,
  IIS2DULPX_DRDY_PULSED  = 0x1,
} iis2dulpx_data_ready_mode_t;
int32_t iis2dulpx_data_ready_mode_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_data_ready_mode_t val);
int32_t iis2dulpx_data_ready_mode_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_data_ready_mode_t *val);

typedef enum {
  IIS2DULPX_OFF               = 0x00, /* in power down */
  IIS2DULPX_1Hz6_ULP          = 0x01, /* @1Hz6 (ultra low power) */
  IIS2DULPX_3Hz_ULP           = 0x02, /* @3Hz (ultra low power) */
  IIS2DULPX_25Hz_ULP          = 0x03, /* @25Hz (ultra low power) */
  IIS2DULPX_6Hz_LP            = 0x04, /* @6Hz (low power) */
  IIS2DULPX_12Hz5_LP          = 0x05, /* @12Hz5 (low power) */
  IIS2DULPX_25Hz_LP           = 0x06, /* @25Hz  (low power ) */
  IIS2DULPX_50Hz_LP           = 0x07, /* @50Hz  (low power) */
  IIS2DULPX_100Hz_LP          = 0x08, /* @100Hz (low power) */
  IIS2DULPX_200Hz_LP          = 0x09, /* @200Hz (low power) */
  IIS2DULPX_400Hz_LP          = 0x0A, /* @400Hz (low power) */
  IIS2DULPX_800Hz_LP          = 0x0B, /* @800Hz (low power) */
  IIS2DULPX_6Hz_HP            = 0x14, /* @6Hz (high performance) */
  IIS2DULPX_12Hz5_HP          = 0x15, /* @12Hz5 (high performance) */
  IIS2DULPX_25Hz_HP           = 0x16, /* @25Hz  (high performance ) */
  IIS2DULPX_50Hz_HP           = 0x17, /* @50Hz  (high performance) */
  IIS2DULPX_100Hz_HP          = 0x18, /* @100Hz (high performance) */
  IIS2DULPX_200Hz_HP          = 0x19, /* @200Hz (high performance) */
  IIS2DULPX_400Hz_HP          = 0x1A, /* @400Hz (high performance) */
  IIS2DULPX_800Hz_HP          = 0x1B, /* @800Hz (high performance) */
  IIS2DULPX_TRIG_PIN          = 0x2E, /* Single-shot high latency by INT2 */
  IIS2DULPX_TRIG_SW           = 0x2F, /* Single-shot high latency by IF */
} iis2dulpx_odr_t;

typedef enum {
  IIS2DULPX_2g   = 0,
  IIS2DULPX_4g   = 1,
  IIS2DULPX_8g   = 2,
  IIS2DULPX_16g  = 3,
} iis2dulpx_fs_t;

typedef enum {
  IIS2DULPX_ODR_div_2   = 0,
  IIS2DULPX_ODR_div_4   = 1,
  IIS2DULPX_ODR_div_8   = 2,
  IIS2DULPX_ODR_div_16  = 3,
} iis2dulpx_bw_t;

typedef struct {
  iis2dulpx_odr_t odr;
  iis2dulpx_fs_t fs;
  iis2dulpx_bw_t bw;
} iis2dulpx_md_t;
int32_t iis2dulpx_mode_set(const iis2dulpx_ctx_t *ctx, const iis2dulpx_md_t *val);
int32_t iis2dulpx_mode_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_md_t *val);

int32_t iis2dulpx_t_ah_qvar_dis_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_t_ah_qvar_dis_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

int32_t iis2dulpx_trigger_sw(const iis2dulpx_ctx_t *ctx, const iis2dulpx_md_t *md);

typedef struct {
  uint8_t drdy                         : 1;
  uint8_t timestamp                    : 1;
  uint8_t free_fall                    : 1;
  uint8_t wake_up                      : 1;
  uint8_t wake_up_z                    : 1;
  uint8_t wake_up_y                    : 1;
  uint8_t wake_up_x                    : 1;
  uint8_t single_tap                   : 1;
  uint8_t double_tap                   : 1;
  uint8_t triple_tap                   : 1;
  uint8_t six_d                        : 1;
  uint8_t six_d_xl                     : 1;
  uint8_t six_d_xh                     : 1;
  uint8_t six_d_yl                     : 1;
  uint8_t six_d_yh                     : 1;
  uint8_t six_d_zl                     : 1;
  uint8_t six_d_zh                     : 1;
  uint8_t sleep_change                 : 1;
  uint8_t sleep_state                  : 1;
  uint8_t tilt                         : 1;
  uint8_t fifo_bdr                     : 1;
  uint8_t fifo_full                    : 1;
  uint8_t fifo_ovr                     : 1;
  uint8_t fifo_th                      : 1;
} iis2dulpx_all_sources_t;
int32_t iis2dulpx_all_sources_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_all_sources_t *val);

