stm32duino/IIS2DULPX/src/iis2dulpx_reg.h
typedef struct {
  float_t mg[3];
  int16_t raw[3];
} iis2dulpx_xl_data_t;
int32_t iis2dulpx_xl_data_get(const iis2dulpx_ctx_t *ctx, const iis2dulpx_md_t *md,
                              iis2dulpx_xl_data_t *data);

typedef struct {
  struct {
    float_t deg_c;
    int16_t raw;
  } heat;
} iis2dulpx_outt_data_t;
int32_t iis2dulpx_outt_data_get(const iis2dulpx_ctx_t *ctx,
                                iis2dulpx_outt_data_t *data);

typedef struct {
  float_t mv;
  int16_t raw;
} iis2dulpx_ah_qvar_data_t;
int32_t iis2dulpx_ah_qvar_data_get(const iis2dulpx_ctx_t *ctx,
                                   iis2dulpx_ah_qvar_data_t *data);

typedef enum {
  IIS2DULPX_XL_ST_DISABLE  = 0x0,
  IIS2DULPX_XL_ST_POSITIVE = 0x1,
  IIS2DULPX_XL_ST_NEGATIVE = 0x2,
} iis2dulpx_xl_self_test_t;
int32_t iis2dulpx_self_test_sign_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_xl_self_test_t val);
int32_t iis2dulpx_self_test_start(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_self_test_stop(const iis2dulpx_ctx_t *ctx);

int32_t iis2dulpx_enter_deep_power_down(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_exit_deep_power_down(const iis2dulpx_ctx_t *ctx);

int32_t iis2dulpx_disable_hard_reset_from_cs_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_disable_hard_reset_from_cs_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DULPX_I3C_BUS_AVAIL_TIME_20US = 0x0,
  IIS2DULPX_I3C_BUS_AVAIL_TIME_50US = 0x1,
  IIS2DULPX_I3C_BUS_AVAIL_TIME_1MS  = 0x2,
  IIS2DULPX_I3C_BUS_AVAIL_TIME_25MS = 0x3,
} iis2dulpx_bus_act_sel_t;

typedef struct {
  iis2dulpx_bus_act_sel_t bus_act_sel;
  uint8_t asf_on                       : 1;
  uint8_t drstdaa_en                   : 1;
} iis2dulpx_i3c_cfg_t;
int32_t iis2dulpx_i3c_configure_set(const iis2dulpx_ctx_t *ctx, const iis2dulpx_i3c_cfg_t *val);
int32_t iis2dulpx_i3c_configure_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_i3c_cfg_t *val);

typedef enum {
  IIS2DULPX_MAIN_MEM_BANK       = 0x0,
  IIS2DULPX_EMBED_FUNC_MEM_BANK = 0x1,
} iis2dulpx_mem_bank_t;
int32_t iis2dulpx_mem_bank_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_mem_bank_t val);
int32_t iis2dulpx_mem_bank_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_mem_bank_t *val);

int32_t iis2dulpx_ln_pg_write(const iis2dulpx_ctx_t *ctx, uint16_t address, uint8_t *buf, uint8_t len);
int32_t iis2dulpx_ln_pg_read(const iis2dulpx_ctx_t *ctx, uint16_t address, uint8_t *buf, uint8_t len);

int32_t iis2dulpx_ext_clk_en_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_ext_clk_en_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

typedef struct {
  uint8_t sdo_pull_up                  : 1; /* 1 = pull up enable */
  uint8_t sda_pull_up                  : 1; /* 1 = pull up enable */
  uint8_t cs_pull_up                   : 1; /* 1 = pull up enable */
  uint8_t int1_int2_push_pull          : 1; /* 1 = push-pull / 0 = open-drain*/
  uint8_t int1_pull_down               : 1; /* 1 = pull-down always disabled (0=auto) */
  uint8_t int2_pull_down               : 1; /* 1 = pull-down always disabled (0=auto) */
} iis2dulpx_pin_conf_t;
int32_t iis2dulpx_pin_conf_set(const iis2dulpx_ctx_t *ctx, const iis2dulpx_pin_conf_t *val);
int32_t iis2dulpx_pin_conf_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_pin_conf_t *val);

typedef enum {
  IIS2DULPX_ACTIVE_HIGH = 0x0,
  IIS2DULPX_ACTIVE_LOW  = 0x1,
} iis2dulpx_int_pin_polarity_t;
int32_t iis2dulpx_int_pin_polarity_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_int_pin_polarity_t val);
int32_t iis2dulpx_int_pin_polarity_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_int_pin_polarity_t *val);

typedef enum {
  IIS2DULPX_SPI_4_WIRE  = 0x0, /* SPI 4 wires */
  IIS2DULPX_SPI_3_WIRE  = 0x1, /* SPI 3 wires */
} iis2dulpx_spi_mode;
int32_t iis2dulpx_spi_mode_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_spi_mode val);
int32_t iis2dulpx_spi_mode_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_spi_mode *val);

typedef struct {
  uint8_t int_on_res                   : 1; /* Interrupt on RES pin */
  uint8_t drdy                         : 1; /* Accelerometer data ready */
  uint8_t boot                         : 1; /* Restoring calibration parameters */
  uint8_t fifo_th                      : 1; /* FIFO threshold reached */
  uint8_t fifo_ovr                     : 1; /* FIFO overrun */
  uint8_t fifo_full                    : 1; /* FIFO full */
  uint8_t free_fall                    : 1; /* free fall event */
  uint8_t six_d                        : 1; /* orientation change (6D/4D detection) */
  uint8_t tap                          : 1; /* all tap event */
  uint8_t wake_up                      : 1; /* wake up event */
  uint8_t sleep_change                 : 1; /* Act/Inact (or Vice-versa) status changed */
  uint8_t emb_function                 : 1; /* Embedded Function */
  uint8_t timestamp                    : 1; /* Timestamp */
} iis2dulpx_pin_int_route_t;
int32_t iis2dulpx_pin_int1_route_set(const iis2dulpx_ctx_t *ctx,
                                     const iis2dulpx_pin_int_route_t *val);
int32_t iis2dulpx_pin_int1_route_get(const iis2dulpx_ctx_t *ctx,
                                     iis2dulpx_pin_int_route_t *val);
int32_t iis2dulpx_pin_int2_route_set(const iis2dulpx_ctx_t *ctx,
                                     const iis2dulpx_pin_int_route_t *val);
int32_t iis2dulpx_pin_int2_route_get(const iis2dulpx_ctx_t *ctx,
                                     iis2dulpx_pin_int_route_t *val);

typedef struct {
  uint8_t step_det                     : 1; /* route step detection event on INT pad */
  uint8_t tilt                         : 1; /* route tilt event on INT pad */
  uint8_t sig_mot                      : 1; /* route significant motion event on INT pad */
  uint8_t fsm_lc                       : 1; /* route FSM long counter event on INT pad */
} iis2dulpx_emb_pin_int_route_t;
int32_t iis2dulpx_emb_pin_int1_route_set(const iis2dulpx_ctx_t *ctx,
                                         const iis2dulpx_emb_pin_int_route_t *val);
int32_t iis2dulpx_emb_pin_int1_route_get(const iis2dulpx_ctx_t *ctx,
                                         iis2dulpx_emb_pin_int_route_t *val);
int32_t iis2dulpx_emb_pin_int2_route_set(const iis2dulpx_ctx_t *ctx,
                                         const iis2dulpx_emb_pin_int_route_t *val);
int32_t iis2dulpx_emb_pin_int2_route_get(const iis2dulpx_ctx_t *ctx,
                                         iis2dulpx_emb_pin_int_route_t *val);

