stm32duino/IIS2DULPX/src/iis2dulpx_reg.h
typedef enum {
  IIS2DULPX_INT_DISABLED             = 0x0,
  IIS2DULPX_INT_LEVEL                = 0x1,
  IIS2DULPX_INT_LATCHED              = 0x2,
} iis2dulpx_int_cfg_t;

typedef struct {
  iis2dulpx_int_cfg_t int_cfg;
  uint8_t sleep_status_on_int          : 1;  /* route sleep_status on interrupt */
  uint8_t dis_rst_lir_all_int          : 1;  /* disable LIR reset when reading ALL_INT_SRC */
} iis2dulpx_int_config_t;
int32_t iis2dulpx_int_config_set(const iis2dulpx_ctx_t *ctx, const iis2dulpx_int_config_t *val);
int32_t iis2dulpx_int_config_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_int_config_t *val);

typedef enum {
  IIS2DULPX_EMBEDDED_INT_LEVEL         = 0x0,
  IIS2DULPX_EMBEDDED_INT_LATCHED       = 0x1,
} iis2dulpx_embedded_int_config_t;
int32_t iis2dulpx_embedded_int_cfg_set(const iis2dulpx_ctx_t *ctx,
                                       iis2dulpx_embedded_int_config_t val);
int32_t iis2dulpx_embedded_int_cfg_get(const iis2dulpx_ctx_t *ctx,
                                       iis2dulpx_embedded_int_config_t *val);

typedef enum {
  IIS2DULPX_BYPASS_MODE              = 0x0,
  IIS2DULPX_FIFO_MODE                = 0x1,
  IIS2DULPX_STREAM_TO_FIFO_MODE      = 0x3,
  IIS2DULPX_BYPASS_TO_STREAM_MODE    = 0x4,
  IIS2DULPX_STREAM_MODE              = 0x6,
  IIS2DULPX_BYPASS_TO_FIFO_MODE      = 0x7,
  IIS2DULPX_FIFO_OFF                 = 0x8,
} iis2dulpx_operation_t;

typedef enum {
  IIS2DULPX_FIFO_1X                  = 0,
  IIS2DULPX_FIFO_2X                  = 1,
} iis2dulpx_store_t;

typedef enum {
  IIS2DULPX_DEC_TS_OFF             = 0x0,
  IIS2DULPX_DEC_TS_1               = 0x1,
  IIS2DULPX_DEC_TS_8               = 0x2,
  IIS2DULPX_DEC_TS_32              = 0x3,
} iis2dulpx_dec_ts_t;

typedef enum {
  IIS2DULPX_BDR_XL_ODR             = 0x0,
  IIS2DULPX_BDR_XL_ODR_DIV_2       = 0x1,
  IIS2DULPX_BDR_XL_ODR_DIV_4       = 0x2,
  IIS2DULPX_BDR_XL_ODR_DIV_8       = 0x3,
  IIS2DULPX_BDR_XL_ODR_DIV_16      = 0x4,
  IIS2DULPX_BDR_XL_ODR_DIV_32      = 0x5,
  IIS2DULPX_BDR_XL_ODR_DIV_64      = 0x6,
  IIS2DULPX_BDR_XL_ODR_OFF         = 0x7,
} iis2dulpx_bdr_xl_t;

typedef enum {
  IIS2DULPX_FIFO_EV_WTM           = 0x0,
  IIS2DULPX_FIFO_EV_FULL          = 0x1,
} iis2dulpx_fifo_event_t;

typedef struct {
  iis2dulpx_operation_t operation;
  iis2dulpx_store_t store;
  uint8_t xl_only                      : 1; /* only XL samples (16-bit) are stored in FIFO */
  uint8_t watermark                    : 7; /* (0 disable) max 127 @16bit, even and max 256 @8bit.*/
  uint8_t cfg_change_in_fifo           : 1;
  iis2dulpx_fifo_event_t fifo_event      : 1; /* 0: FIFO watermark, 1: FIFO full */
  struct {
    iis2dulpx_dec_ts_t dec_ts; /* decimation for timestamp batching*/
    iis2dulpx_bdr_xl_t bdr_xl; /* accelerometer batch data rate*/
  } batch;
} iis2dulpx_fifo_mode_t;
int32_t iis2dulpx_fifo_mode_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_fifo_mode_t val);
int32_t iis2dulpx_fifo_mode_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_fifo_mode_t *val);

int32_t iis2dulpx_fifo_data_level_get(const iis2dulpx_ctx_t *ctx, uint16_t *val);
int32_t iis2dulpx_fifo_wtm_flag_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DULPX_FIFO_EMPTY                 = 0x0,
  IIS2DULPX_XL_TEMP_TAG                = 0x2,
  IIS2DULPX_XL_ONLY_2X_TAG             = 0x3,
  IIS2DULPX_TIMESTAMP_TAG              = 0x4,
  IIS2DULPX_STEP_COUNTER_TAG           = 0x12,
  IIS2DULPX_MLC_RESULT_TAG             = 0x1A,
  IIS2DULPX_MLC_FILTER_TAG             = 0x1B,
  IIS2DULPX_MLC_FEATURE                = 0x1C,
  IIS2DULPX_FSM_RESULT_TAG             = 0x1D,
  IIS2DULPX_XL_ONLY_2X_TAG_2ND         = 0x1E,
  IIS2DULPX_XL_AND_QVAR                = 0x1F,
} iis2dulpx_fifo_sensor_tag_t;
int32_t iis2dulpx_fifo_sensor_tag_get(const iis2dulpx_ctx_t *ctx,
                                      iis2dulpx_fifo_sensor_tag_t *val);

int32_t iis2dulpx_fifo_out_raw_get(const iis2dulpx_ctx_t *ctx, uint8_t *buff);

typedef struct {
  uint8_t tag;
  struct {
    float_t mg[3];
    int16_t raw[3];
  } xl[2];
  struct {
    float_t mv;
    int16_t raw;
  } ah_qvar;
  struct {
    float_t deg_c;
    int16_t raw;
  } heat;
  struct {
    uint32_t steps;
    uint32_t timestamp;
  } pedo;
  struct {
    uint8_t cfg_change                 : 1; /* 1 if ODR/BDR configuration is changed */
    uint8_t odr                        : 4; /* ODR */
    uint8_t bw                         : 2; /* BW */
    uint8_t lp_hp                      : 1; /* Power: 0 for LP, 1 for HP */
    uint8_t qvar_en                    : 1; /* QVAR is enabled */
    uint8_t fs                         : 2; /* FS */
    uint8_t dec_ts                     : 2; /* Timestamp decimator value */
    uint8_t odr_xl_batch               : 1; /* Accelerometer ODR is batched */
    uint32_t timestamp;
  } cfg_chg;
} iis2dulpx_fifo_data_t;
int32_t iis2dulpx_fifo_data_get(const iis2dulpx_ctx_t *ctx, const iis2dulpx_md_t *md,
                                const iis2dulpx_fifo_mode_t *fmd,
                                iis2dulpx_fifo_data_t *data);

typedef enum {
  IIS2DULPX_NOTCH_50HZ       = 0x0,
  IIS2DULPX_NOTCH_60HZ       = 0x1,
} iis2dulpx_ah_qvar_notch_t;

typedef enum {
  IIS2DULPX_520MOhm          = 0x0,
  IIS2DULPX_175MOhm          = 0x1,
  IIS2DULPX_310MOhm          = 0x2,
  IIS2DULPX_75MOhm           = 0x3,
} iis2dulpx_ah_qvar_zin_t;

typedef enum {
  IIS2DULPX_GAIN_0_5         = 0x0,
  IIS2DULPX_GAIN_1           = 0x1,
  IIS2DULPX_GAIN_2           = 0x2,
  IIS2DULPX_GAIN_4           = 0x3,
} iis2dulpx_ah_qvar_gain_t;

typedef struct {
  uint8_t ah_qvar_en                   : 1;
  uint8_t ah_qvar_notch_en             : 1;
  iis2dulpx_ah_qvar_notch_t ah_qvar_notch;
  iis2dulpx_ah_qvar_zin_t ah_qvar_zin;
  iis2dulpx_ah_qvar_gain_t ah_qvar_gain;
} iis2dulpx_ah_qvar_mode_t;
int32_t iis2dulpx_ah_qvar_mode_set(const iis2dulpx_ctx_t *ctx,
                                   iis2dulpx_ah_qvar_mode_t val);
int32_t iis2dulpx_ah_qvar_mode_get(const iis2dulpx_ctx_t *ctx,
                                   iis2dulpx_ah_qvar_mode_t *val);

