stm32duino/IIS2DULPX/src/iis2dulpx_reg.h
typedef struct {
  uint8_t false_step_rej               : 1;
  uint8_t step_counter_enable          : 1;
  uint8_t step_counter_in_fifo         : 1;
} iis2dulpx_stpcnt_mode_t;
int32_t iis2dulpx_stpcnt_mode_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_stpcnt_mode_t val);
int32_t iis2dulpx_stpcnt_mode_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_stpcnt_mode_t *val);

int32_t iis2dulpx_stpcnt_steps_get(const iis2dulpx_ctx_t *ctx, uint16_t *val);

int32_t iis2dulpx_stpcnt_rst_step_set(const iis2dulpx_ctx_t *ctx);

int32_t iis2dulpx_stpcnt_debounce_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_stpcnt_debounce_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

int32_t iis2dulpx_stpcnt_period_set(const iis2dulpx_ctx_t *ctx, uint16_t val);
int32_t iis2dulpx_stpcnt_period_get(const iis2dulpx_ctx_t *ctx, uint16_t *val);

typedef struct {
  uint8_t enable                       : 1;
  uint8_t window                       : 1;
  uint8_t duration                     : 1;
} iis2dulpx_smart_power_cfg_t;
int32_t iis2dulpx_smart_power_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_smart_power_cfg_t val);
int32_t iis2dulpx_smart_power_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_smart_power_cfg_t *val);

int32_t iis2dulpx_tilt_mode_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_tilt_mode_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);
int32_t iis2dulpx_sigmot_mode_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_sigmot_mode_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);


int32_t iis2dulpx_ff_duration_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_ff_duration_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DULPX_156_mg = 0x0,
  IIS2DULPX_219_mg = 0x1,
  IIS2DULPX_250_mg = 0x2,
  IIS2DULPX_312_mg = 0x3,
  IIS2DULPX_344_mg = 0x4,
  IIS2DULPX_406_mg = 0x5,
  IIS2DULPX_469_mg = 0x6,
  IIS2DULPX_500_mg = 0x7,
} iis2dulpx_ff_thresholds_t;
int32_t iis2dulpx_ff_thresholds_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_ff_thresholds_t val);
int32_t iis2dulpx_ff_thresholds_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_ff_thresholds_t *val);

typedef enum {
  IIS2DULPX_DEG_80 = 0x0,
  IIS2DULPX_DEG_70 = 0x1,
  IIS2DULPX_DEG_60 = 0x2,
  IIS2DULPX_DEG_50 = 0x3,
} iis2dulpx_threshold_t;

typedef enum {
  IIS2DULPX_6D = 0x0,
  IIS2DULPX_4D = 0x1,
} iis2dulpx_mode_t;

typedef struct {
  iis2dulpx_threshold_t threshold;
  iis2dulpx_mode_t mode;
} iis2dulpx_sixd_config_t;

int32_t iis2dulpx_sixd_config_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_sixd_config_t val);
int32_t iis2dulpx_sixd_config_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_sixd_config_t *val);

typedef enum {
  IIS2DULPX_0_ODR  = 0x000, /* 0 ODR time */
  IIS2DULPX_1_ODR  = 0x001, /* 1 ODR time */
  IIS2DULPX_2_ODR  = 0x002, /* 2 ODR time */
  IIS2DULPX_3_ODR  = 0x100, /* 3 ODR time */
  IIS2DULPX_7_ODR  = 0x101, /* 7 ODR time */
  IIS2DULPX_11_ODR = 0x102, /* 11 ODR time */
  IIS2DULPX_15_ODR = 0x103, /* 15 ODR time */
} iis2dulpx_wake_dur_t;

typedef enum {
  IIS2DULPX_SLEEP_OFF = 0,
  IIS2DULPX_SLEEP_ON  = 1,
} iis2dulpx_wake_enable_t;

typedef enum {
  IIS2DULPX_ODR_NO_CHANGE       = 0,  /* no odr change during inactivity state */
  IIS2DULPX_ODR_1_6_HZ          = 1,  /* set odr to 1.6Hz during inactivity state */
  IIS2DULPX_ODR_3_HZ            = 1,  /* set odr to 3Hz during inactivity state */
  IIS2DULPX_ODR_25_HZ           = 1,  /* set odr to 25Hz during inactivity state */
} iis2dulpx_inact_odr_t;

typedef struct {
  iis2dulpx_wake_dur_t wake_dur;
  uint8_t sleep_dur                    : 4;       /* 1 LSB == 512 ODR time */
  uint8_t wake_ths                     : 7;       /* wakeup threshold */
  uint8_t wake_ths_weight              : 1;       /* 0: 1LSB = FS_XL/2^6, 1: 1LSB = FS_XL/2^8 */
  iis2dulpx_wake_enable_t wake_enable;
  iis2dulpx_inact_odr_t inact_odr;
} iis2dulpx_wakeup_config_t;

int32_t iis2dulpx_wakeup_config_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_wakeup_config_t val);
int32_t iis2dulpx_wakeup_config_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_wakeup_config_t *val);

typedef enum {
  IIS2DULPX_TAP_NONE  = 0x0, /* No axis */
  IIS2DULPX_TAP_ON_X  = 0x1, /* Detect tap on X axis */
  IIS2DULPX_TAP_ON_Y  = 0x2, /* Detect tap on Y axis */
  IIS2DULPX_TAP_ON_Z  = 0x3, /* Detect tap on Z axis */
} iis2dulpx_axis_t;

typedef struct {
  iis2dulpx_axis_t axis;
  uint8_t inverted_peak_time           : 5; /* 1 LSB == 1 sample */
  uint8_t pre_still_ths                : 4; /* 1 LSB == 62.5 mg */
  uint8_t post_still_ths               : 4; /* 1 LSB == 62.5 mg */
  uint8_t post_still_time              : 6; /* samples num during stationary condition */
  uint8_t shock_wait_time              : 6; /* samples num during shock condition */
  uint8_t latency                      : 4; /* samples max num between taps */
  uint8_t wait_end_latency             : 1; /* wait end of latency time to generate tap events */
  uint8_t peak_ths                     : 6; /* 1 LSB == 62.5 mg */
  uint8_t rebound                      : 5; /* samples num during rebound condition */
  uint8_t pre_still_start              : 4; /* pre still start */
  uint8_t pre_still_n                  : 4; /* pre still n */
  uint8_t single_tap_on                : 1; /* enable single tap */
  uint8_t double_tap_on                : 1; /* enable double tap */
  uint8_t triple_tap_on                : 1; /* enable triple tap */
} iis2dulpx_tap_config_t;

int32_t iis2dulpx_tap_config_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_tap_config_t val);
int32_t iis2dulpx_tap_config_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_tap_config_t *val);

int32_t iis2dulpx_timestamp_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_timestamp_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

int32_t iis2dulpx_timestamp_raw_get(const iis2dulpx_ctx_t *ctx, uint32_t *val);

int32_t iis2dulpx_long_cnt_flag_data_ready_get(const iis2dulpx_ctx_t *ctx,
                                               uint8_t *val);

int32_t iis2dulpx_emb_fsm_en_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_emb_fsm_en_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

