stm32duino/IIS2DULPX/src/iis2dulpx_reg.h
typedef struct {
  iis2dulpx_fsm_enable_t          fsm_enable;
} iis2dulpx_emb_fsm_enable_t;
int32_t iis2dulpx_fsm_enable_set(const iis2dulpx_ctx_t *ctx,
                                 iis2dulpx_emb_fsm_enable_t *val);
int32_t iis2dulpx_fsm_enable_get(const iis2dulpx_ctx_t *ctx,
                                 iis2dulpx_emb_fsm_enable_t *val);

int32_t iis2dulpx_long_cnt_set(const iis2dulpx_ctx_t *ctx, uint16_t val);
int32_t iis2dulpx_long_cnt_get(const iis2dulpx_ctx_t *ctx, uint16_t *val);

int32_t iis2dulpx_fsm_status_get(const iis2dulpx_ctx_t *ctx,
                                 iis2dulpx_fsm_status_mainpage_t *val);
int32_t iis2dulpx_fsm_out_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

typedef enum {
  IIS2DULPX_ODR_FSM_12Hz5 = 0,
  IIS2DULPX_ODR_FSM_25Hz  = 1,
  IIS2DULPX_ODR_FSM_50Hz  = 2,
  IIS2DULPX_ODR_FSM_100Hz = 3,
  IIS2DULPX_ODR_FSM_200Hz = 4,
  IIS2DULPX_ODR_FSM_400Hz = 5,
  IIS2DULPX_ODR_FSM_800Hz = 6,
} iis2dulpx_fsm_val_odr_t;
int32_t iis2dulpx_fsm_data_rate_set(const iis2dulpx_ctx_t *ctx,
                                    iis2dulpx_fsm_val_odr_t val);
int32_t iis2dulpx_fsm_data_rate_get(const iis2dulpx_ctx_t *ctx,
                                    iis2dulpx_fsm_val_odr_t *val);

int32_t iis2dulpx_fsm_init_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_fsm_init_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

int32_t iis2dulpx_fsm_fifo_en_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_fsm_fifo_en_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

int32_t iis2dulpx_long_cnt_int_value_set(const iis2dulpx_ctx_t *ctx,
                                         uint16_t val);
int32_t iis2dulpx_long_cnt_int_value_get(const iis2dulpx_ctx_t *ctx,
                                         uint16_t *val);

int32_t iis2dulpx_fsm_programs_num_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_fsm_programs_num_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

int32_t iis2dulpx_fsm_start_address_set(const iis2dulpx_ctx_t *ctx,
                                        uint16_t val);
int32_t iis2dulpx_fsm_start_address_get(const iis2dulpx_ctx_t *ctx,
                                        uint16_t *val);

typedef enum {
  IIS2DULPX_MLC_OFF                    = 0,
  IIS2DULPX_MLC_ON                     = 1,
  IIS2DULPX_MLC_ON_BEFORE_FSM          = 2,
} iis2dulpx_mlc_mode_t;
int32_t iis2dulpx_mlc_set(const iis2dulpx_ctx_t *ctx, iis2dulpx_mlc_mode_t val);
int32_t iis2dulpx_mlc_get(const iis2dulpx_ctx_t *ctx, iis2dulpx_mlc_mode_t *val);

int32_t iis2dulpx_mlc_status_get(const iis2dulpx_ctx_t *ctx,
                                 iis2dulpx_mlc_status_mainpage_t *val);

int32_t iis2dulpx_mlc_out_get(const iis2dulpx_ctx_t *ctx, uint8_t *buff);

typedef enum {
  IIS2DULPX_ODR_PRGS_12Hz5 = 0,
  IIS2DULPX_ODR_PRGS_25Hz  = 1,
  IIS2DULPX_ODR_PRGS_50Hz  = 2,
  IIS2DULPX_ODR_PRGS_100Hz = 3,
  IIS2DULPX_ODR_PRGS_200Hz = 4,
} iis2dulpx_mlc_odr_val_t;
int32_t iis2dulpx_mlc_data_rate_set(const iis2dulpx_ctx_t *ctx,
                                    iis2dulpx_mlc_odr_val_t val);
int32_t iis2dulpx_mlc_data_rate_get(const iis2dulpx_ctx_t *ctx,
                                    iis2dulpx_mlc_odr_val_t *val);

int32_t iis2dulpx_mlc_fifo_en_set(const iis2dulpx_ctx_t *ctx, uint8_t val);
int32_t iis2dulpx_mlc_fifo_en_get(const iis2dulpx_ctx_t *ctx, uint8_t *val);

#ifdef __cplusplus
}
#endif

#endif /* IIS2DULPX_REGS_H */
